In [72]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')
df = pd.read_excel('turbo_az.xlsx')
df

                         car       price                  details
0            Peugeot Partner  40 000 AZN        2022, 1.5 L, 0 km
1                 Opel Astra   9 000 AZN  2009, 1.4 L, 257 000 km
2             Mercedes S 350    61 000 $  2014, 3.0 L, 150 000 km
3                 Fiat Doblo  45 800 AZN        2022, 1.4 L, 0 km
4                 Kia Optima  29 900 AZN  2014, 2.0 L, 215 000 km
...                      ...         ...                      ...
14971        LADA (VAZ) 2107   6 200 AZN   2007, 1.6 L, 55 000 km
14972  Mercedes Sprinter 311  25 400 AZN  2008, 2.2 L, 198 000 km
14973        Mercedes ML 250  59 542 AZN   2014, 2.1 L, 56 000 km
14974         Mercedes C 240  15 300 AZN  1999, 2.4 L, 187 600 km
14975            Hyundai H-1  23 542 AZN  2012, 2.5 L, 210 000 km

[14976 rows x 3 columns]

In [73]:
#checking for regular expression that it works or not
import re
re.findall(r"\w+","Mercedes Sprinter 311")[0]

'Mercedes'

In [74]:
#car type
df['make'] = df['car'].str.extract('(\w+)')[0]

In [75]:
#creating empty column to not get KeyError when we tryna create type column in the next cell
import numpy as np
df['type'] = np.nan

In [76]:
#car model
for i,j in enumerate(df['make']):
    df['type'][i] = df['car'][i].replace(j,'')

In [77]:
#droping car
df.drop('car',inplace=True,axis=1)

In [78]:
df.head()

        price                  details      make      type
0  40 000 AZN        2022, 1.5 L, 0 km   Peugeot   Partner
1   9 000 AZN  2009, 1.4 L, 257 000 km      Opel     Astra
2    61 000 $  2014, 3.0 L, 150 000 km  Mercedes     S 350
3  45 800 AZN        2022, 1.4 L, 0 km      Fiat     Doblo
4  29 900 AZN  2014, 2.0 L, 215 000 km       Kia    Optima

In [79]:
#droping space in price
df['price'] = df['price'].astype('str')
df['price'] = df['price'].str.replace(' ','')

In [80]:
#checking for regular expression that it works or not
re.findall(r"\D+","61000$")

['$']

In [81]:
#creating currency column
df['currency'] = df['price'].str.extract('(\D+)')

In [82]:
df.head()

      price                  details      make      type currency
0  40000AZN        2022, 1.5 L, 0 km   Peugeot   Partner      AZN
1   9000AZN  2009, 1.4 L, 257 000 km      Opel     Astra      AZN
2    61000$  2014, 3.0 L, 150 000 km  Mercedes     S 350        $
3  45800AZN        2022, 1.4 L, 0 km      Fiat     Doblo      AZN
4  29900AZN  2014, 2.0 L, 215 000 km       Kia    Optima      AZN

In [83]:
#checking for regular expression that it works or not
re.findall(r"\d+","61000$")

['61000']

In [84]:
#changing price in numbers
df['price'] = df['price'].str.extract('(\d+)')

In [85]:
df.head()

   price                  details      make      type currency
0  40000        2022, 1.5 L, 0 km   Peugeot   Partner      AZN
1   9000  2009, 1.4 L, 257 000 km      Opel     Astra      AZN
2  61000  2014, 3.0 L, 150 000 km  Mercedes     S 350        $
3  45800        2022, 1.4 L, 0 km      Fiat     Doblo      AZN
4  29900  2014, 2.0 L, 215 000 km       Kia    Optima      AZN

In [86]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14976 entries, 0 to 14975
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   price     14976 non-null  object
 1   details   14976 non-null  object
 2   make      14976 non-null  object
 3   type      14976 non-null  object
 4   currency  14976 non-null  object
dtypes: object(5)
memory usage: 585.1+ KB

In [87]:
#changing dtype of price to the integer
df['price'] = df['price'].astype('int')

In [88]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14976 entries, 0 to 14975
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   price     14976 non-null  int64
 1   details   14976 non-null  object
 2   make      14976 non-null  object
 3   type      14976 non-null  object
 4   currency  14976 non-null  object
dtypes: int64(1), object(4)
memory usage: 585.1+ KB

In [89]:
df.head()

   price                  details      make      type currency
0  40000        2022, 1.5 L, 0 km   Peugeot   Partner      AZN
1   9000  2009, 1.4 L, 257 000 km      Opel     Astra      AZN
2  61000  2014, 3.0 L, 150 000 km  Mercedes     S 350        $
3  45800        2022, 1.4 L, 0 km      Fiat     Doblo      AZN
4  29900  2014, 2.0 L, 215 000 km       Kia    Optima      AZN

In [90]:
#replacing all spaces
df['details'] = df['details'].str.replace(' ','')

In [91]:
#checking for regular expression that it works or not
re.split(r"(,)","2022,1.4L,0km")

['2022', ',', '1.4L', ',', '0km']

In [92]:
# creating empty column is named year to not get KeyError 
df['year'] = np.nan
# filling year column 
for i,j in enumerate(df['details']):
    df['year'][i] = re.split(r"(,)",j)[0]

In [93]:
df.head()

   price             details      make      type currency  year
0  40000       2022,1.5L,0km   Peugeot   Partner      AZN  2022
1   9000  2009,1.4L,257000km      Opel     Astra      AZN  2009
2  61000  2014,3.0L,150000km  Mercedes     S 350        $  2014
3  45800       2022,1.4L,0km      Fiat     Doblo      AZN  2022
4  29900  2014,2.0L,215000km       Kia    Optima      AZN  2014

In [94]:
# creating empty column is named year to not get KeyError 
df['engine'] = np.nan
# filling year column 
for i,j in enumerate(df['details']):
    df['engine'][i] = re.split(r"(,)",j)[2]

In [95]:
df.head()

   price             details      make      type currency  year engine
0  40000       2022,1.5L,0km   Peugeot   Partner      AZN  2022   1.5L
1   9000  2009,1.4L,257000km      Opel     Astra      AZN  2009   1.4L
2  61000  2014,3.0L,150000km  Mercedes     S 350        $  2014   3.0L
3  45800       2022,1.4L,0km      Fiat     Doblo      AZN  2022   1.4L
4  29900  2014,2.0L,215000km       Kia    Optima      AZN  2014   2.0L

In [96]:
#checking for regular expression that it works or not
re.split(r"(,)","2022,1.4L,0km")[4]

'0km'

In [97]:
# creating empty column is named year to not get KeyError 
df['mileage'] = np.nan
# filling year column 
for i,j in enumerate(df['details']):
    df['mileage'][i] = re.split(r"(,)",j)[4]

In [98]:
df.head()

,price,details,make,type,currency,year,engine,mileage
0,40000,"2022,1.5L,0km",Peugeot,Partner,AZN,2022,1.5L,0km
1,9000,"2009,1.4L,257000km",Opel,Astra,AZN,2009,1.4L,257000km
2,61000,"2014,3.0L,150000km",Mercedes,S 350,$,2014,3.0L,150000km
3,45800,"2022,1.4L,0km",Fiat,Doblo,AZN,2022,1.4L,0km
4,29900,"2014,2.0L,215000km",Kia,Optima,AZN,2014,2.0L,215000km

In [100]:
#deleting details column
df.drop('details', axis=1, inplace=True)

In [104]:
#creating empty column named price_in_azn
df['price_in_azn'] = np.nan
#we have to currency like AZN and USD so,let's get change the all prices in azn
for i,j in enumerate(df['price']):
    if df['currency'][i] == 'AZN':
        df['price_in_azn'][i] = j
    else:
        df['price_in_azn'][i] = j * 1.7

In [107]:
#deleting price and currency,we don't neet them because of the price_in_azn
df.drop(['price','currency'], axis=1, inplace=True)

In [108]:
df.head()

       make      type  year engine   mileage  price_in_azn
0   Peugeot   Partner  2022   1.5L       0km       40000.0
1      Opel     Astra  2009   1.4L  257000km        9000.0
2  Mercedes     S 350  2014   3.0L  150000km      103700.0
3      Fiat     Doblo  2022   1.4L       0km       45800.0
4       Kia    Optima  2014   2.0L  215000km       29900.0

In [112]:
#replace all L from engine 
df['engine'] = df['engine'].str.replace('L','')

In [128]:
#checking for regular expression that it works or not
re.findall(r"\D+","0km")

['km']

In [133]:
df['mileage_type'] = df['mileage'].str.extract('(\D+)')

In [136]:
df['mileage_type'].value_counts()
#all milages in km's so,there is no any need to calculate something to the mile or km,
#let's just get numbers from mileage

km    14976
Name: mileage_type, dtype: int64

In [141]:
df.drop('mileage_type', axis=1, inplace=True)

In [137]:
df['mileage'] = df['mileage'].str.extract('(\d+)')

In [143]:
#change some columns to the another dtypes
df['engine'] = df['engine'].astype('float')
df['mileage'] = df['mileage'].astype('float')
df['year'] = df['year'].astype('int')

In [144]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14976 entries, 0 to 14975
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   make          14976 non-null  object
 1   type          14976 non-null  object
 2   year          14976 non-null  int64
 3   engine        14976 non-null  float64
 4   mileage       14976 non-null  float64
 5   price_in_azn  14976 non-null  float64
dtypes: float64(3), int64(1), object(2)
memory usage: 702.1+ KB

In [145]:
df.head()

       make      type  year  engine   mileage  price_in_azn
0   Peugeot   Partner  2022     1.5       0.0       40000.0
1      Opel     Astra  2009     1.4  257000.0        9000.0
2  Mercedes     S 350  2014     3.0  150000.0      103700.0
3      Fiat     Doblo  2022     1.4       0.0       45800.0
4       Kia    Optima  2014     2.0  215000.0       29900.0

In [146]:
df.to_csv('final_data.csv')